{
  "place": "Kalemegdan Fortress",
  "destination": "Belgrade, Serbia",
  "type": "Historical Fortress and Park",
  "description": "Belgrade Fortress consists of the old citadel (Upper and Lower Town) and Kalemegdan Park on the confluence of the Sava and Danube rivers. The fortress was built during a long period from the 2nd to the 18th century, destroyed and rebuilt numerous times.",
  "history": {
    "origin": "At the beginning of the 1st century CE, most probably between 6 and 11 CE, increasingly frequent attacks by barbarian tribes led to the establishment of the first Roman military camp.",
    "roman_period": "At the beginning of the 2nd century, Singidunum became the seat of the Flavian Fourth Legion, nicknamed Felix or Lucky. The first Roman fortification was of the earthen-palisade type before a castrum was built with a rectangular base, 560 metres long and about 350 metres wide.",
    "ottoman_period": "During the third siege of Belgrade in 1521, Sultan Suleiman the Magnificent managed to capture the city. The Turks called the city field in front of the fortress 'Kalemegdan' ('kale' meaning city and 'megdan' meaning field).",
    "liberation": "The Turkish commander of Belgrade handed over the keys to the city to Prince Mihailo Obrenović on 6th April 1867."
  },
  "architecture": {
    "structure": "Fortress remains are divided into Upper and Lower Town",
    "styles": "Two clear stylistic features - elements of medieval architecture permeated with dominant Baroque elements characteristic of the XVIII century",
    "turkish_buildings": "Fountain of Sokollu Mehmed Pasha from the second half of the 16th century and the tomb of Damat Ali Pasha from the 18th century",
    "underground": "Kilometers-long tunnels, underground corridors and catacombs, which are still largely unexplored"
  },
  "visiting_information": {
    "entry": "Free entry to the park and main fortress areas",
    "operating_hours": "Gates open 24/7 all year round",
    "combined_ticket": "450 dinars for all attractions (with discounts available)",
    "attractions": {
      "roman_well": "120 dinars, Tuesday-Sunday, 11am-5pm/7pm",
      "nebojsa_tower": "200 dinars, Wednesday-Sunday, 11am-5pm/7pm",
      "military_bunker": "100 dinars, Tuesday-Sunday, 11am-5pm/7pm",
      "clock_tower": "80 dinars, Tuesday-Sunday, 11am-5pm/7pm"
    },
    "transportation": "Buses and trolleybuses - Lines 41, 40, 28, 29 and 31 run to Student Park"
  },
  "highlights": {
    "views": "Amazing views of city skyline and confluence of Danube and Sava Rivers",
    "museums": "Military Museum and numerous galleries",
    "status": "Most visited tourist attraction in Belgrade"
  },
  "interesting_facts": [
    "The fortress has been destroyed and rebuilt more than 40 times throughout history",
    "It sits at the strategic confluence of two major European rivers",
    "Contains largely unexplored underground tunnels and catacombs",
    "Free to visit 24 hours a day, 365 days a year"
  ]
}
