{
  "place": "Knez Mihailova Street",
  "destination": "Belgrade, Serbia",
  "type": "Pedestrian Shopping Street",
  "description": "Knez Mihailova Street is the main pedestrian and shopping zone in Belgrade, protected by law as one of the oldest and most valuable landmarks of the city. Named after Mihailo Obrenović, a Serbian Prince, it features numerous buildings built during the 1870s.",
  "history": {
    "ancient_origins": "The roots of Knez Mihailova trace back to the Roman city of Singidunum, where this vital passage carved its way as the main access route into the fortified heart of the settlement, aligning with the Roman via cardo.",
    "protection": {
      "1964": "Protected as the spatial cultural-historical unit, the first cultural monument of that type in Belgrade",
      "1979": "Elevated to Spatial Cultural-Historical Units of Great Importance"
    },
    "pedestrianization": "For much of the 20th century the street was open to traffic and parking. In 1987 the city decided to pedestrianize it, and since then it has become the central symbol of Belgrade."
  },
  "characteristics": {
    "length": "One kilometer long",
    "architecture": "Buildings from the 1870s featuring Neo-Renaissance and Neo-Baroque styles",
    "recognition": "Named one of the most beautiful pedestrian zones in South East Europe"
  },
  "shopping": {
    "international_brands": [
      "Mango",
      "Zara",
      "Zara Men",
      "Gap",
      "Nike",
      "Replay",
      "Diesel",
      "Terranova",
      "Sephora",
      "New Look",
      "Swarovski",
      "Cesare Paciotti",
      "Tally Weijl",
      "Miss Sixty",
      "Bata",
      "Bally",
      "Aldo",
      "Adidas",
      "Vapiano",
      "Monsoon Accessorize"
    ],
    "amenities": "Numerous cafes, restaurants, and entertainment venues"
  },
  "visitor_experience": {
    "atmosphere": "Always busy with a lively atmosphere",
    "activities": "Shopping, dining, people watching, street performances",
    "connection": "Street extends to Republic Square and leads directly to Kalemegdan Fortress"
  },
  "cultural_significance": "Central symbol of Belgrade since pedestrianization, serving as the main commercial and social hub of the city",
  "interesting_facts": [
    "Follows the ancient Roman via cardo from Singidunum",
    "First cultural monument of its type protected in Belgrade (1964)",
    "One kilometer of uninterrupted pedestrian zone",
    "Named after Prince Mihailo Obrenović, who liberated Belgrade from Ottoman rule",
    "One of the most beautiful pedestrian zones in Southeast Europe"
  ]
}
