{
  "place": "Ali and Nino Statue (Man and Woman)",
  "type": "attraction",
  "description": "An iconic 8-meter-high kinetic sculpture created by Georgian artist Tamara Kvesitadze in 2010. The sculpture features two transparent steel figures representing a Muslim boy (Ali) and a Georgian princess (Nino) from the famous 1937 novel by Kurban Said. Every day at 7 PM, the figures slowly move toward each other, merge through one another in a brief embrace, and then separate, symbolizing their tragic love story. The entire automated performance takes 10 minutes and is dramatically lit with changing colored lights.",
  "highlights": [
    "8-meter-high moving steel sculpture weighing approximately 7 tonnes",
    "Daily kinetic performance at 7 PM where the figures merge and separate over 10 minutes",
    "Made of stacked transparent steel segments that pass through each other",
    "Originally showcased at the 52nd Venice Biennale in 2007 before permanent installation in Batumi in 2010",
    "Computer-controlled movement with dramatic colored lighting effects",
    "Located prominently on Batumi Boulevard, 50 meters from the Alphabet Tower and Ferris wheel",
    "Free to visit and accessible 24/7",
    "Represents the tragic love story from Azerbaijan's most famous novel 'Ali and Nino'"
  ],
  "tips": [
    "Visit at 7 PM to witness the moving sculpture's daily performance",
    "Evening visits offer the best experience with dramatic lighting effects",
    "The nighttime ambiance adds a magical quality to the statue",
    "Daytime visits provide clear views and better photo opportunities",
    "Best visited from late spring through September for optimal weather",
    "Located in the Park of Wonders along Batumi Boulevard at the harbor entrance",
    "Combine with visits to nearby attractions: Ferris wheel and Alphabet Tower (both 50m away)",
    "The entire performance cycle takes 10 minutes - plan to stay for the full show",
    "Completely free attraction with no entrance fee",
    "The sculpture is also officially known as 'Man and Woman' from its Venice Biennale debut"
  ],
  "vibe": "Romantic, melancholic, and deeply symbolic. This moving sculpture captures the bittersweet nature of impossible love and cultural division. The mechanical precision of the daily ritual creates a meditative, almost hypnotic atmosphere, especially when illuminated at night. It serves as both a monument to love transcending boundaries and a reminder of how external forces can tear lovers apart. The sculpture's position on the seaside boulevard, with the Black Sea as backdrop, adds to its contemplative and poignant character. It's become one of Batumi's most photographed landmarks and a symbol of the city's embrace of contemporary art and cultural tolerance."
}
