{
  "place": "Argo Cable Car",
  "type": "attraction",
  "description": "The Argo Cable Car is a spectacular urban cable way system that connects downtown Batumi with the Anuria Mountain entertainment complex, 256 meters above sea level. Operating since 2013, this modern Doppelmayr cable car system has transported over two million passengers, offering breathtaking panoramic views of the Black Sea, Batumi cityscape, and surrounding mountains during the 10-minute journey. The complex is named after the mythical ship Argo, on which Jason and the Argonauts sailed to Colchis to retrieve the Golden Fleece, celebrating Georgia's connection to ancient Greek mythology.",
  "highlights": [
    "2,586-meter cable car route reaching 256 meters elevation on Anuria Mountain",
    "20 eight-seat gondolas with capacity for 500 passengers per hour",
    "10-minute scenic journey offering 360-degree panoramic views of Batumi, Black Sea, and mountains",
    "Entertainment complex at summit featuring digital museum with immersive 360-degree art installations",
    "Joyroom attraction with mirror mazes, selfie spots, private jet simulator, and interactive experiences",
    "Observation deck with sweeping vistas perfect for photography",
    "Multiple dining options including restaurants, cafes, wine bar, and outdoor deck cafe",
    "Traditional Georgian folklore evenings in summer (8 PM) featuring UNESCO-recognized dances, songs, and martial arts",
    "Shopping units offering wine and local souvenirs",
    "Modern Doppelmayr cable car system ensuring smooth and comfortable ride"
  ],
  "tips": [
    "Operating hours: 10:00 AM to 11:00 PM daily",
    "Ticket prices: Adults 30 GEL, Children 5-12 years 7 GEL, Under 5 years 10 GEL (round-trip included)",
    "Tickets valid for 6 months from purchase date",
    "Beware of taxi drivers and scammers providing false pricing information",
    "Cable car may be suspended during strong winds for safety, but operates in light rain",
    "Best time to visit: sunset hours for spectacular views of the city lights and sea",
    "Plan to spend 1-2 hours at the top station to fully explore the entertainment complex",
    "Bring a camera for the observation deck - the views are exceptional",
    "Try Georgian wine at the wine bar while enjoying the mountain views",
    "Check folklore evening schedule in summer for cultural performances at 8 PM",
    "Lower station located on Bako Street in central Batumi - easily accessible",
    "Contact: argocablecar@gmail.com or +995 591 870 008 for inquiries"
  ],
  "vibe": "Modern adventure meets cultural entertainment with spectacular mountain-top views. The Argo Cable Car offers a thrilling aerial experience combined with family-friendly attractions, authentic Georgian cultural performances, and world-class panoramic vistas. The journey itself is an attraction, gliding smoothly above the cityscape toward the entertainment complex that blends digital art, traditional culture, dining, and observation platforms. It's a must-visit destination that appeals to families, couples, photographers, and culture enthusiasts, providing both excitement and relaxation in a stunning natural setting. The mythological Argo theme adds a layer of storytelling that connects visitors to Georgia's ancient heritage and the legend of the Golden Fleece."
}
