{
  "place": "Batumi Botanical Garden",
  "type": "attraction",
  "description": "One of the largest botanical gardens in the former Soviet Union, the Batumi Botanical Garden is a spectacular 108-hectare (270-acre) paradise of subtropical flora located on the Black Sea coast at Mtsvane Kontskhi (The Green Cape). Founded by Russian botanist Andrey Krasnov in 1912, this living museum houses over 2,000 species of woody plants from around the world, organized into nine phytogeographic sections representing different global regions.",
  "highlights": [
    "Nine floristic sectors representing Caucasian humid subtropics, East Asia, New Zealand, South America, the Himalayas, Mexico, Australia, and the Mediterranean",
    "Collection of 2,037 taxonomic units of woody plants, including 104 species of Caucasian origin",
    "Extensive collections of rhododendrons, camellias (78 varieties), and magnolias",
    "Spectacular groves of bamboo, eucalyptus, and palm trees",
    "17 Red List protected species including the endangered Podocarpus nubigenus",
    "Historic 100-year-old Queen Marshall rose",
    "Unique living bridge formed from a 72-year-old double-breasted liriodendron that fell during a 1985 storm",
    "Founder Andrey Krasnov's grave and statue located within the garden",
    "Up to 170 rose species on display",
    "Research facilities including herbarium collections, experimental plots, and living seed banks",
    "Stunning Black Sea coastal views throughout the garden",
    "Designated camping and picnic areas"
  ],
  "tips": [
    "Allow 3-4 hours for a comprehensive visit, though nature enthusiasts may want half a day",
    "Visit between June-October for the best blooms and favorable weather",
    "Spring is spectacular for blossoms, autumn for fall colors",
    "Take the electric bus tour (10 GEL for foreign travelers) to cover more ground, especially useful for the large 108-hectare area",
    "Bring water bottles - there are spring water fountains throughout the garden where you can refill",
    "Pack snacks or a picnic as food options inside are limited to a couple of snack stands",
    "Arrive early in the day during summer months to avoid the midday heat",
    "Wear comfortable walking shoes as there's extensive walking on varied terrain",
    "Located 9-10 km north of Batumi - take minibus 31 or bus 10, or taxi for 15-20 lari",
    "Check opening hours: May-September 09:00-19:30, October-March 10:00-18:00",
    "General admission is 20 GEL for foreign visitors",
    "Don't miss the North American section with the unique living bridge",
    "Visit the camellia collection - some varieties were planted before the garden's official founding",
    "Camping is available for 50 GEL per night in designated areas"
  ],
  "vibe": "A tranquil scientific sanctuary where global botanical wonders meet dramatic Black Sea coastline. This is both a serious research institution and a spectacular natural retreat, offering a peaceful escape into diverse plant worlds from Mediterranean groves to Himalayan flora. The garden radiates a sense of living history, with century-old specimens, the founder's grave, and Soviet-era scientific legacy creating an atmosphere of botanical reverence. Perfect for nature lovers, photographers, families, and anyone seeking a serene day surrounded by extraordinary plant diversity and stunning coastal views.",
  "additional_information": {
    "established": "November 3, 1912",
    "founder": "Andrey Nikolayevich Krasnov (Russian botanist, died 1914)",
    "location": "Mtsvane Kontskhi (The Green Cape), 9 km north of Batumi",
    "size": "108 hectares (270 acres)",
    "admission": {
      "foreign_visitors": "20 GEL",
      "georgian_citizens": "10 GEL",
      "students": "5 GEL",
      "schoolchildren": "2 GEL",
      "children_under_6": "Free"
    },
    "opening_hours": {
      "may_september": "09:00-19:30",
      "october_march": "10:00-18:00",
      "days": "Every day including holidays"
    },
    "transportation": {
      "public": "Minibus 31 or Bus 10",
      "taxi": "15-20 GEL from Batumi center"
    },
    "historical_notes": [
      "Started by Andrey Krasnov in the 1880s, officially opened 1912",
      "Krasnov worked with French gardener D'Alphonse and Georgian Yason Gordeziani",
      "Expanded significantly under Soviet Union from 1925",
      "Became principal institution for study of Caucasian maritime subtropical cultures",
      "Some camellia varieties predate the garden's official founding"
    ],
    "conservation_status": "Major center for study and conservation of subtropical flora, operates living seed banks for biodiversity preservation"
  }
}
