{
  "place": "Piazza Square",
  "type": "attraction",
  "description": "Batumi Piazza is an architectural complex completed in 2010 that recreates the atmosphere of a small Italian town in the heart of Old Batumi. Designed by Georgian architect Vazha Orbeladze and inspired by Florence's Piazza della Signoria, this 5,700 square meter complex features Italian-style architecture with stained-glass windows by Estonian artist Dolores Hoffman. The centerpiece is Europe's largest figurative marble mosaic, a stunning 106 square meter masterpiece created by Georgian-Swiss designer Natalie de Pita-Amirejibi using 88,244,735 marble pieces from 15 countries.",
  "highlights": [
    "Europe's largest figurative marble mosaic covering 106 square meters with 88,244,735 individual marble pieces",
    "Italian-inspired architecture with a prominent clock tower as the main focal point",
    "Unique stained-glass windows designed by Estonian artist Dolores Hoffman",
    "Five water deities mosaic symbolizing the connection between the sea and eternal movement",
    "Historic St. Nicholas Church - the oldest building in Batumi located within the square",
    "Cozy cafes and restaurants offering Georgian and European cuisine",
    "Live music performances and concerts during summer, including performances by world stars like Placido Domingo and Michel Legrand",
    "Beautiful evening decorative lighting that transforms the atmosphere"
  ],
  "tips": [
    "Visit in the evening when decorative lighting creates a magical ambiance",
    "Access the square from Tsar Parnavaz, Vakhtang Gorgasali, or General Mazniashvili streets",
    "Use public transport: buses #1, 10, 10a, 15 stop at Gogebashvili Street; buses #3, 4, 7, 9, 9a, 11, 13 stop at Nikoloz Baratashvili Street",
    "Note that there is no dedicated parking and the square is hidden behind surrounding buildings",
    "Plan 5-10 minutes walking time from Old Batumi or about an hour from New Boulevard area",
    "Visit during summer to enjoy live concerts and cultural events",
    "Take time to study the marble mosaic details - each piece is just 1 square centimeter",
    "Combine your visit with nearby attractions like Holy Mother Virgin Nativity Cathedral, Europe Square, and Miracle Park"
  ],
  "vibe": "A romantic Italian oasis in the heart of Batumi, Piazza Square offers a sophisticated European atmosphere perfect for leisurely strolls, al fresco dining, and cultural immersion. The hidden gem creates an intimate, almost secretive ambiance, tucked away from the main streets yet bustling with cafe culture, live music, and artistic beauty. Evening visits reveal its most enchanting character when lights illuminate the ornate facades and the marble mosaic sparkles underfoot."
}
