{
  "place": "Alphabetic Tower",
  "type": "attraction",
  "description": "The Alphabetic Tower is a 130-meter-high landmark structure in Batumi, Georgia, built to commemorate the Georgian alphabet. Designed by Spanish architect Alberto Domingo Cabo and completed in 2011, the tower combines the structural design of DNA's double helix pattern with all 33 letters of the modern Georgian alphabet. Each 4-meter-tall aluminum letter ascends the tower on two helix bands, symbolizing how the Georgian language unites the Georgian people, just as DNA contains the body's vital information.",
  "highlights": [
    "130 meters tall - one of the most recognizable buildings in the Batumi skyline",
    "All 33 letters of the Georgian alphabet displayed as 4-meter-tall aluminum letters on a double helix structure",
    "Panoramic revolving restaurant that rotates 360 degrees over the course of one hour (operates 14:00-24:00, rotation 20:00-24:00)",
    "Observation deck with open terrace offering 360-degree views of Batumi and the Black Sea",
    "Two panoramic elevators providing access to the top of the tower",
    "Located in Miracle Park on the old boulevard, T. Abuladze Street",
    "Built by Spanish architect Alberto Domingo Cabo and Spanish company CMD Ingenieros",
    "UNESCO recognition: In 2016, Georgian language was inscribed on the list of intangible cultural heritage of humanity"
  ],
  "tips": [
    "Open daily from 11:00 to 24:00 (midnight)",
    "Entrance fee: 20 GEL for adults, 10 GEL for children",
    "Best visited during sunset or evening hours for spectacular views and restaurant experience",
    "The restaurant rotation occurs from 20:00 to 24:00 - book ahead if you want the rotating experience",
    "Allow at least 1-2 hours to fully enjoy the observation deck and restaurant",
    "The tower was leased to a Spanish company in 2015 for 20 years, so facilities are maintained",
    "Take photos from ground level to capture the full architectural design with the Georgian letters",
    "Combine your visit with a walk along the old boulevard and Miracle Park"
  ],
  "vibe": "A striking fusion of ancient Georgian cultural pride and modern architectural innovation, the Alphabetic Tower stands as both a bold statement of national identity and a unique tourist destination. The DNA-inspired double helix design creates a powerful metaphor - connecting the ancient Georgian alphabet (dating back to the 5th century) with the biological blueprint of life itself. From the top, visitors experience breathtaking panoramic views while literally surrounded by one of the world's 14 unique alphabets. The revolving restaurant adds a touch of sophistication, making it perfect for romantic dinners or special occasions. Despite some operational challenges in its early years, the tower remains an essential Batumi landmark that celebrates Georgia's linguistic heritage in a thoroughly contemporary way. It's simultaneously educational, symbolic, and entertaining - a true monument to cultural preservation meeting 21st-century design."
}
