{
  "place": "Rike Park",
  "type": "attraction",
  "description": "Rike Park is a modern urban oasis in the heart of Tbilisi, opened in 2010 as part of a major urban revitalization project. Designed by Italian architect Michele De Lucchi with landscape architecture by CMD Ingenieros from Valencia, Spain, this 7.5-hectare park transformed what was once a huge asphalt driving practice field into one of Tbilisi's most beloved public spaces. Located on the left bank of the Kura River, the park serves as a symbol of Georgia's blend of tradition and modernity, with its layout forming a large-scale map of Georgia when viewed from above.",
  "highlights": [
    "Bridge of Peace - A stunning curved bow-shaped pedestrian bridge with steel skeleton and glass roof, covered in 50,000 LED lights that illuminate at night and broadcast the periodic table elements in Morse Code",
    "Cable car station offering quick access to Narikala Fortress with panoramic city views",
    "Map of Georgia design - The park's layout, when viewed from above, creates a large-scale map of Georgia with pathways depicting various regions",
    "Rose-shaped mosaic in the center referencing the Rose Revolution",
    "Giant interactive art installations including a giant piano and oversized chess board with one-meter-tall figures",
    "Musical fountain with light shows during warmer months",
    "Ten-meter tall metal oak tree sculpture symbolizing the old city",
    "Rike Concert Hall - Two enormous tubular steel and glass sections designed as a 'periscope' overlooking the city (currently unfinished)",
    "Large open-air amphitheater hosting concerts, performances, and cultural events",
    "Children's playgrounds, climbing walls, and maze",
    "Annual Tbilisoba Festival venue every October celebrating Tbilisi's diverse culture and history"
  ],
  "tips": [
    "Visit in the evening to see the Bridge of Peace illuminated with thousands of LED lights - it's particularly stunning at night",
    "Take the cable car from the park up to Narikala Fortress for incredible panoramic views of Tbilisi",
    "Bring children to enjoy the interactive art installations like the giant piano and chess board",
    "Visit during October to experience the Tbilisoba Festival celebrating Tbilisi's culture and cuisine",
    "The park is easily accessible - take the metro to Avlabari station (10-minute walk) or several city buses drop you near Europe Square",
    "Watch the Musical Fountain light shows during warmer months",
    "The park offers excellent photo opportunities, especially near the Bridge of Peace and along the river",
    "Best for families, couples, and anyone interested in modern architecture and urban design",
    "The park is safe and beautifully lit in the evenings, perfect for evening strolls",
    "Look for the copper tree sculpture with twisting branches symbolizing how old Tiflis streets wind from the main square to the hilltop"
  ],
  "vibe": "Modern, vibrant, and family-friendly with a perfect blend of contemporary architecture and green space. The park buzzes with energy during the day as families, tourists, and locals gather for recreation, cultural events, and socializing. By night, it transforms into a romantic, illuminated wonderland with the glowing Bridge of Peace creating a magical atmosphere. The space represents Tbilisi's successful fusion of tradition and modernity - a symbol of the city's urban renewal and cultural pride. Whether you're watching children play on the giant chess board, attending a concert in the amphitheater, or simply strolling along the river with the futuristic architecture as your backdrop, Rike Park embodies the dynamic, forward-thinking spirit of contemporary Tbilisi while honoring its rich cultural heritage."
}
