{
  "place": "Mother of Georgia (Kartlis Deda)",
  "type": "attraction",
  "description": "Kartlis Deda is a monumental 20-meter aluminum statue overlooking Tbilisi from the top of Sololaki Hill. Created by prominent Georgian sculptor Elguja Amashukeli, this iconic monument was erected in 1958 to commemorate the 1500th anniversary of Tbilisi's founding. The statue depicts a woman in traditional Georgian dress and has become one of the most recognizable symbols of Georgia, embodying the nation's culture, history, identity, and resilience.",
  "highlights": [
    "20-meter aluminum statue designed by Elguja Amashukeli, winner of the 1966 Shota Rustaveli State Prize",
    "Symbolic dual nature: holds a bowl of wine in her left hand to greet friends, and a sword in her right hand for enemies",
    "Breathtaking panoramic views of Tbilisi, including ancient landmarks, modern architecture, and the winding Mtkvari River framed by mountains",
    "Located on Sololaki Hill near the ancient Narikala Fortress, accessible via cable car from Rike Park or hiking up Betlemi Street",
    "Originally a temporary wooden sculpture that was so beloved it was made permanent with aluminum coating in 1963, then replaced with an identical statue in 1997",
    "Represents the Georgian national character of hospitality and strength, resonating with Georgia's ancient culture of wine and warrior spirit"
  ],
  "tips": [
    "Visit during morning or late afternoon for cooler temperatures, fewer crowds, and the best light for photography",
    "Take the cable car from Rike Park (approximately 12 Georgian Lari return ticket, operates 10am-12am daily) for scenic views on the way up",
    "Combine your visit with exploring the nearby Narikala Fortress, just a five-minute walk away on the same hilltop",
    "Sunset from Kartlis Deda is particularly magical, offering golden light over the city",
    "The statue is best photographed from various angles around its base to capture both the monument and the cityscape",
    "Wear comfortable shoes if hiking up Betlemi Street stairs instead of taking the cable car"
  ],
  "vibe": "This powerful monument exudes a sense of maternal protection and national pride. Standing at the base of the towering aluminum figure, visitors feel the weight of Georgia's 1500-year history and the enduring spirit of its people. The dual symbolism of wine and sword perfectly captures the Georgian soul - warmly welcoming to friends while fiercely protective of their homeland. The panoramic views create a contemplative atmosphere where the ancient and modern city merge below, while the statue herself stands as a timeless guardian watching over Tbilisi's trials and triumphs. It's both a symbol of strength and hospitality, resonating deeply with Georgia's cultural identity as a crossroads of civilizations."
}
