{
  "place": "Bridge of Peace",
  "type": "attraction",
  "description": "The Bridge of Peace is a stunning bow-shaped pedestrian bridge spanning 150 meters over the Mtkvari (Kura) River, connecting Old Tbilisi with the modern Rike Park district. This architectural marvel, made of steel and glass with thousands of LED lights, has become one of Tbilisi's most iconic landmarks since its opening in 2010. Designed by Italian architect Michele De Lucchi with lighting by French designer Philippe Martinaud, the bridge's futuristic design resembles a marine animal and creates a striking contrast between Tbilisi's ancient and contemporary identities.",
  "highlights": [
    "Spectacular LED light show featuring over 10,000 LED bulbs that illuminate 90 minutes before sunset",
    "Interactive lighting system with 240 motion sensors that respond to pedestrians walking across",
    "Unique Morse code message transmitted hourly across the parapets, spelling out the chemical elements from Mendeleev's periodic table that make up the human body - described as 'an anthem of life and peace among people and peoples'",
    "Panoramic views of Tbilisi's historic landmarks including Metekhi Church, the statue of city founder Vakhtang Gorgasali, and Narikala Fortress",
    "Contemporary steel and glass canopy design that shimmers and glows, creating a mesmerizing visual experience",
    "Named among the Top-13 most unusual bridges in the world in 2012",
    "Strategic location connecting Old Town with modern Rike Park, serving as both functional crossing and artistic monument"
  ],
  "tips": [
    "Visit at sunset or after dark to experience the full LED light show - lights turn on 90 minutes before sunset",
    "Walk slowly to trigger the motion sensors and watch the lights respond to your movement",
    "Best photography opportunities at sunrise, sunset, or night when the bridge is illuminated",
    "Look for local musicians and choirs performing on the bridge and in the surrounding park",
    "Watch for the hourly Morse code light display that transmits the message about human body elements",
    "Use the bridge to access both Old Tbilisi and the modern Rike Park area - it's a functional pedestrian crossing that saves time",
    "Visit during different times of day to appreciate both the architectural design in daylight and the lighting spectacle at night",
    "Take time to enjoy views from the bridge of surrounding landmarks including Narikala Fortress and Metekhi Church"
  ],
  "vibe": "A harmonious blend of futuristic innovation and symbolic meaning, the Bridge of Peace embodies Tbilisi's evolution from ancient capital to modern metropolis. By day, its sleek glass and steel structure stands as a bold architectural statement against the backdrop of historic Old Town. By night, it transforms into an ethereal, glowing pathway that seems to float above the river, creating a magical atmosphere enhanced by live music and the company of locals and visitors alike. The bridge represents hope, progress, and unity - literally and symbolically connecting Tbilisi's past with its future. It's both a practical crossing and a contemplative space where ancient Georgian culture meets contemporary design, making it a must-visit landmark that captures the essence of modern Tbilisi's dynamic spirit."
}
