{
  "place": "Temple of Literature",
  "type": "cultural",
  "description": "Vietnam's first national university, founded in 1070 by Emperor Ly Thanh Tong to worship Confucius. In 1076, the Imperial Academy (Quoc Tu Giam) was established here to educate Vietnam's bureaucrats, nobles, and elite. It served as the pinnacle of Vietnamese education until 1779, representing over 700 years of scholarly tradition.",
  "highlights": [
    "Five distinct courtyards, each with its own function and architectural beauty",
    "82 stone stelae sitting on turtle backs, depicting names and birthplaces of 1,307 graduates from 82 triennial royal exams",
    "Khue Van Pavilion - officially chosen as the symbol of Hanoi in 1997, featuring four round windows representing the sky",
    "Spanning 54,331 square meters of traditional Vietnamese architecture",
    "Night tours with 3D mapping performances about education and ancient scholars",
    "Perfectly preserved example of Vietnamese royal architecture and garden design"
  ],
  "tips": [
    "Visit early morning for peaceful atmosphere and fewer crowds",
    "Allow 1-2 hours to properly explore all five courtyards",
    "Book night tour for 3D mapping experience depicting stories about education",
    "Bring camera - the symmetry and traditional architecture is photographer's dream",
    "Read about the stone stelae before visiting - understanding their significance enhances experience",
    "Wear comfortable shoes as you'll walk through all five courtyards"
  ],
  "vibe": "Tranquil oasis in the middle of busy Hanoi. The moment you step through the gates, city noise fades. Large shady trees, peaceful courtyards, koi ponds, and the weight of 1,000 years of scholarship create contemplative, almost sacred atmosphere. It feels timeless.",
  "expectations": [
    "An old temple",
    "Some historical artifacts",
    "Maybe a museum"
  ],
  "reality": [
    "It's a masterclass in traditional Vietnamese architecture and urban planning",
    "The five courtyards create journey from worldly to sacred space",
    "Those stone turtles holding stelae are priceless historical records spanning centuries",
    "It's not just a temple - it was Vietnam's Oxford or Harvard for 700 years",
    "The level of preservation is remarkable - you're walking where scholars walked 900 years ago"
  ],
  "unique_facts": [
    "Founded in 1070, making it almost 1,000 years old",
    "The 82 remaining doctors' stelae are UNESCO recognized and invaluable historical resources",
    "In 1253, the temple first opened doors to excellent commoners, not just nobility",
    "Students studied for 3-7 years, learning Chinese penmanship, literature, and poetry",
    "Khue Van Pavilion on 100,000 VND banknote - that's how significant it is to Vietnamese identity",
    "The layout follows traditional Confucian architecture principles, moving from outer worldly space to inner sacred space"
  ],
  "surprises": [
    "How the five courtyard design creates progressive sense of tranquility",
    "The sheer scale - 54,331 square meters in the heart of modern Hanoi",
    "That it's been in continuous cultural use for nearly a millennium",
    "Finding koi fish, ancient trees, and perfectly manicured gardens in each courtyard",
    "The night show with 3D mapping that brings the history to life on the ancient walls",
    "How locals still come here to pray for academic success before exams"
  ]
}
