{
  "place": "Train Street",
  "type": "hidden-gem",
  "description": "A unique and iconic attraction where active trains pass through a narrow residential street just inches away from homes, cafes, and tourists. Photos and videos of trains squeezing through have gone viral on social media, transforming this quiet neighborhood into one of Hanoi's most famous attractions. The surreal experience of sipping coffee feet from passing trains has made it legendary.",
  "highlights": [
    "Trains passing within inches of open-air cafes creating exhilarating experience",
    "Vibrant cafe scene with lanterns and cozy lights, especially in evening",
    "Popular spots: ChuChu Railways, Coffee Chill 96, Hanoi 1990s, 65 Railway Coffee",
    "Photo opportunities before and after train passes",
    "The controlled chaos as cafe owners clear everyone from tracks",
    "Witnessing local life literally on the railway - homes, shops, daily routines"
  ],
  "tips": [
    "Arrive at least one hour early to grab good spot and take photos",
    "Two locations: Old Quarter section (partially closed, need cafe owner escort) and Le Duan section (fully open)",
    "Check train schedule in advance - typically trains pass 2-4 times daily",
    "Listen to cafe owners when train approaches - they know exactly when to clear tracks",
    "Evening visits offer best atmosphere with glowing lanterns and lights",
    "Order coffee or cocktail to secure your spot",
    "Stay completely off tracks and respect cafe safety guidelines",
    "Don't place objects or tripods near railway"
  ],
  "vibe": "Electric anticipation mixed with surreal normalcy. Cafes buzz with excited tourists and locals going about daily life inches from active railway. When train horn sounds, controlled frenzy as everyone clears tracks. Then massive train thunders past, so close you feel the wind. Afterward, instant reset - tables and chairs back on tracks, coffee flowing again like nothing happened. Repeat.",
  "expectations": [
    "Seeing a train on a street",
    "Taking cool photos",
    "Novelty attraction"
  ],
  "reality": [
    "It's an actual functioning railway with real daily train schedules",
    "People actually live here - homes, laundry, kids playing on the tracks between trains",
    "The street is so narrow the train clearing is measured in inches",
    "Cafe owners have turned potential danger into thriving business",
    "Government trying to shut it down for years but it persists",
    "The adrenaline rush is real when that train bears down on you",
    "Between trains, locals sit on tracks drinking coffee like it's the most normal thing"
  ],
  "unique_facts": [
    "Main section near Old Quarter partially closed but accessible via cafe owner escort",
    "Le Duan section remains fully open with no restrictions",
    "Trains typically pass 2-4 times daily depending on schedule",
    "Government has attempted permanent shutdowns multiple times for safety",
    "Tiny cafes along tracks rely heavily on tourist visitors for income",
    "The street is so narrow that residents must pull in motorbikes and fold up furniture when train comes",
    "It's gone viral countless times on TikTok, Instagram, YouTube"
  ],
  "surprises": [
    "That people actually live full lives here - it's not a tourist set, it's a real neighborhood",
    "How calm cafe owners are - they've done this thousands of times",
    "The train is MUCH closer than you imagine - you could touch it",
    "How quickly everything resets after train passes - tables back, order taken, like nothing happened",
    "Finding laundry hanging above tracks, kids doing homework, grandmothers cooking between train times",
    "That it's under constant threat of closure but keeps surviving",
    "The mix of tourists freaking out while locals barely glance up from their pho"
  ]
}
