{
  "place": "Vietnam Museum of Ethnology",
  "type": "cultural",
  "description": "Established in 1997, this world-class museum serves as both research center and public exhibition space showcasing the cultures of Vietnam's 54 ethnic groups through 15,000 artifacts. The complex features three main buildings and a 2-hectare outdoor garden with authentic traditional houses, recognized by Asia Book of Records for performing daily without closure.",
  "highlights": [
    "Bronze Drum Building - main exhibition designed by architect Ha Duc Linh",
    "Kite Building (2013) - four-story structure focusing on Southeast Asian ethnic groups",
    "Architectural Garden - 10 authentic traditional houses from different ethnic groups",
    "15,000 artifacts showcasing diverse cultural heritage",
    "Interactive workshops on traditional crafts and instruments",
    "Traditional music and dance performances",
    "Video displays of funerary ceremonies and cultural practices",
    "Exhibits on elephant domestication and tourism adaptation",
    "Costume try-on experiences"
  ],
  "tips": [
    "Set aside at least 2-3 hours to explore thoroughly",
    "Open Tuesday-Sunday, 8:30am-5:30pm (closed Mondays)",
    "Entrance: Adults 40,000 VND, Children under 16: 15,000 VND",
    "Located 6.5 km west of city center - take taxi, Grab, or bus 14/38",
    "Tour guides available in 8 languages (Vietnamese, English, French, Spanish, Korean, Japanese, Thai, Chinese)",
    "Photography not allowed inside indoor exhibition halls",
    "Wear comfortable walking shoes and bring water",
    "Arrive in morning to avoid crowds and enjoy peaceful experience",
    "Best visited in cooler months due to outdoor walking"
  ],
  "vibe": "A captivating journey through Vietnam's ethnic tapestry, where ancient traditions come alive through artifacts, architecture, and immersive experiences. The outdoor garden feels like stepping into different worlds as you move between tribal houses, while indoor exhibitions reveal the intricate beauty of 54 distinct cultures. It's educational yet enchanting, showing how diverse peoples coexist and preserve their heritage in modern Vietnam."
}
