{
  "place": "Thang Long Water Puppet Theatre",
  "type": "cultural",
  "description": "A renowned cultural venue showcasing traditional Vietnamese water puppetry, an art form dating back to the Ly Dynasty in the Red River Delta. Established in 1969, the theatre performs over 500 shows annually for 150,000+ visitors. Recognized by Asia Book of Records as the only theatre performing every day of the year, it combines live traditional music, colorful wooden puppets, and water stage to tell Vietnamese folklore and historical tales.",
  "highlights": [
    "50-60 minute shows featuring Vietnamese folktales and history",
    "Skilled puppeteers controlling wooden puppets from behind bamboo screen",
    "Live traditional instruments: Erhu, Flute, Zither, Monochord",
    "Traditional Cheo singing performances",
    "Visual effects: fireworks, water splashes, smoke, laser lighting",
    "Stories featuring dragons, martial arts, fishing, buffalo riding",
    "Ancient art form from the Red River Delta region",
    "Daily performances recognized by Asia Book of Records",
    "Located steps from Hoan Kiem Lake"
  ],
  "tips": [
    "Show times: 3pm, 4:10pm, 5:20pm, 6:30pm, 8pm (weekdays)",
    "Sunday additions: 9:30am, 1:45pm, 9:15pm",
    "Book tickets in advance for best seating",
    "Rent audio guide for small fee to understand storylines and background",
    "Reserve seats via email: marketingthanglongwpt@gmail.com",
    "Located at 57B Dinh Tien Hoang Street, near Hoan Kiem Lake",
    "Shows last 50-60 minutes",
    "Post-show: visit theatre café overlooking Hoan Kiem Lake",
    "Souvenir shop available in-house",
    "Audio translators available in multiple languages"
  ],
  "vibe": "Magical and enchanting, the water puppet show transports audiences into Vietnam's ancient folklore. The splash of water mingles with traditional music as wooden dragons dance and fishermen cast their nets. Puppeteers hidden behind bamboo screens bring centuries-old stories to life with remarkable skill. The intimate theatre fills with wonder as mythical creatures emerge from the water, making this uniquely Vietnamese art form unforgettable for all ages."
}
