{
  "place": "One Pillar Pagoda",
  "type": "cultural",
  "description": "A unique Buddhist temple built in 1049 by Emperor Ly Thai Tong, formally called Dien Huu Tu (Pagoda of Extended Blessings). The iconic structure sits on a single stone pillar rising from water, designed to resemble a lotus flower blooming from muddy waters. Regarded alongside the Huong Temple as one of Vietnam's two most iconic temples, it was rebuilt in 1955 after being destroyed in 1954.",
  "highlights": [
    "Unique architecture - temple built on single 4-meter stone pillar",
    "Pillar diameter: 1.2 meters representing lotus stem",
    "Eight wooden beams forming eight flower petals",
    "Red brick scale-tiled roof with four curved corners",
    "Statue of Bodhisattva Avalokiteshvara inside",
    "Tam Quan Gate with carved Dien Huu Pagoda inscription",
    "13 stairs representing fertility and prosperity wish",
    "Bodhi tree gifted by Indian President Rajendra Prasad in 1958",
    "Recognized by Asia Book of Records (2012) as unique pagoda in Asia",
    "Located in Ho Chi Minh Mausoleum complex"
  ],
  "tips": [
    "Located on Ong Ich Khiem Street, Doi Can Ward, Ba Dinh District",
    "Free admission for Vietnamese citizens",
    "Foreigners: 25,000 VND entrance fee",
    "Best time to visit: August-November for lotus blossom season",
    "Wear discreet, polite clothing - no shorts or skirts above knee",
    "Walk softly and speak quietly inside",
    "Do not touch ancient artifacts",
    "Pay attention to restricted area signs",
    "Combine with visits to Ho Chi Minh Mausoleum, Temple of Literature, Hoan Kiem Lake",
    "Original structure from 1049, perfected in 1105"
  ],
  "vibe": "Delicate yet enduring, the One Pillar Pagoda embodies the lotus flower rising pure from muddy waters - a Buddhist symbol of enlightenment. The ancient legend of Emperor Ly Thai Tong's dream adds mystical depth to this architectural wonder. Standing on its single pillar for nearly 1,000 years (with one rebuild), it represents both imperial devotion and engineering brilliance, offering visitors a moment of contemplation in one of Vietnam's most photographed and spiritually significant sites."
}
