{
  "place": "Train Street",
  "type": "attraction",
  "description": "A narrow railway track running through a residential neighborhood in Hanoi's Old Quarter, where trains pass within inches of cafés, homes, and parked motorbikes. Built by the French in 1902, this iconic street has become a global tourist sensation despite government attempts to close it for safety reasons. The street showcases the unique way Hanoians adapt to urban constraints.",
  "highlights": [
    "Trains passing mere inches from cafés and homes",
    "Vibrant atmosphere with colorful lanterns and foliage",
    "Two main sections: Le Duan (Dong Da) and Phung Hung (Old Quarter)",
    "Thrilling close encounters with passing trains",
    "Unique photo opportunities against moving trains",
    "Local café culture along the tracks",
    "French colonial railway from 1902",
    "Reopened for tourists in early 2023"
  ],
  "tips": [
    "Saturday-Sunday trains: 6am, 9am, 11:20am, 3:30pm, 5:30pm, 6pm, 7pm, 7:45pm, 8:30pm, 9pm, 11pm",
    "Monday-Friday trains: 7pm, 7:45pm, 8:30pm, 10pm",
    "Arrive 30 minutes to 1 hour before train time to secure café seating",
    "Avoid weekends - weekday visits are less crowded",
    "Best season: Spring (March-April) or Autumn (September-November)",
    "Stand behind yellow safety line painted on ground",
    "Never touch the passing train - extremely dangerous",
    "Keep tracks completely clear - don't sit on rails for photos",
    "Try Hanoi 1990s café or 65 Railway Coffee for authentic experience",
    "Double-check train times as schedules change without notice"
  ],
  "vibe": "Equal parts thrilling and surreal, Train Street offers an adrenaline rush found nowhere else. Sitting at a café sipping Vietnamese coffee while a massive train thunders past your table is both terrifying and exhilarating. The locals' nonchalance adds to the experience - they've adapted so completely that laundry hangs just feet from the tracks. It's chaotic urban living at its most extreme, where danger and daily life exist in precarious harmony."
}
