{
  "place": "Hanoi Opera House",
  "type": "cultural",
  "description": "A stunning French neoclassical architectural masterpiece built 1901-1911 during colonial rule, inspired by Paris's Palais Garnier. Designed by French architects Broyer and Harley, this 2,600 m² building stands 34 meters high and hosts Vietnam's premier opera, ballet, drama, and symphony performances. After serving as a government meeting place post-1945, it was restored and declared a National Relic in 2011.",
  "highlights": [
    "French neoclassical architecture with grand facade and iconic dome",
    "Ornate balconies, Corinthian columns, and wrought-iron railings",
    "Main auditorium with 598 seats across three layers",
    "Crystal chandeliers and large wall mirrors",
    "Colorful graffiti dome and 19th-century French-style chairs",
    "Excellent acoustics for performances",
    "Annual Toyota Concert (August) and Hennessy Classical Concert",
    "Guided tours of backstage, dressing rooms, and rehearsal spaces",
    "One of three French-built opera houses in Indochina",
    "National Relic status since December 2011"
  ],
  "tips": [
    "Located at Square of August Revolution, Trang Tien Street, Hoan Kiem District",
    "Opening hours: Mainly Mondays and Fridays, 10:30am-12pm (1.5 hour tours)",
    "Closed weekends and public holidays unless special events",
    "Performance tickets: 200,000 VND - 1,000,000+ VND depending on seats",
    "Regular tours: 100,000-150,000 VND",
    "Bus routes: 02, 04, 34, 43, 45, 49, 86",
    "Book performance tickets in advance for popular shows",
    "Avoid flash photography or tripods during performances",
    "Dress appropriately for classical performances",
    "Best photo opportunities: grand facade, sweeping staircases, ornate interior"
  ],
  "vibe": "Elegant and majestic, the Hanoi Opera House transports visitors to belle époque Paris. Crystal chandeliers cast soft light on ornate Corinthian columns while the hushed anticipation before performances fills the air with magic. This architectural jewel represents both colonial legacy and Vietnamese cultural pride - a space where world-class artistry meets historical grandeur, and where the echoes of a century of performances still resonate through gilded halls."
}
